module.exports = {
  /** 用于验证字符串是否为“数字px”的形式 */
  pxTestReg: /(?<=\d)px/,
  /** 用于匹配字符串形如“数字px”中的“数字”，不可以在 url() 中
   *
   * (\d+\.\d+|\d+|\.\d+) // 数字
   *
   * url\((\\\(|\\\)|[^\(\)])*\) // url(...)
   *
   * (?<=(url\((\\\(|\\\)|[^\(\)])*\)).*?)(\d+\.\d+|\d+|\.\d+) // 前面必须有 url()
   *
   * (\d+\.\d+|\d+|\.\d+)(?=(url\((\\\(|\\\)|[^\(\)])*\)).*?) // 后面必选有 url()
   *
   * (?<!url.*?)(\d+\.\d+|\d+|\.\d+)(?!.*?url) // 前面和后面都没有 url
   */
  pxMatchReg: /((?<=(url\((\\\(|\\\)|[^\(\)])*\)).*?)(\d+\.\d+|\d+|\.\d+))|((\d+\.\d+|\d+|\.\d+)(?=(url\((\\\(|\\\)|[^\(\)])*\)).*?))|((?<!url.*?)(\d+\.\d+|\d+|\.\d+)(?!.*?url))/g,

}